
## Plan Result (prod)




<pre><code>Plan: 3 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_PORT
* Update
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
        id                      = "https://am-prod.vault.azure.net/secrets/judicial-booking-service-POSTGRES-PASS/8f73b08ac21e40ec8c0439bb219d3839"
        name                    = "judicial-booking-service-POSTGRES-PASS"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-USER" {
        id                      = "https://am-prod.vault.azure.net/secrets/judicial-booking-service-POSTGRES-USER/e63eacea88b14fa5a85a7170b61e3166"
        name                    = "judicial-booking-service-POSTGRES-USER"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/am-shared-infrastructure-prod/providers/Microsoft.KeyVault/vaults/am-prod"
      + name                    = "judicial-booking-service-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/am-shared-infrastructure-prod/providers/Microsoft.KeyVault/vaults/am-prod"
      + name                    = "judicial-booking-service-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/am-shared-infrastructure-prod/providers/Microsoft.KeyVault/vaults/am-prod"
      + name                    = "judicial-booking-service-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 3 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1068,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->